[
  [
    {
      "id": 5,
      "href": "https://pl.indeed.com/rc/clk?jk=8afc10f27b9773b9&bb=nBiv9VFjOgI6JFVotktcpV0ny2avhZld5MO-TDcRz-PPd1Rqd5Hl81IDmU1LV0mxyU5Z7lN-PDGcHV1UbzKSH6ouAXfD8mtrDtGvYLz62LonnICRKJTEBvA8OJORA6WE&xkcb=SoDG67M370wyw5TToZ0ObzkdCdPP&fccid=38081eb9e2cc9206&vjs=3",
      "title": "Senior Software Frontend Engineer - Hybrid, Poland",
      "applyUrl": "https://pl.indeed.com/viewjob?jk=8afc10f27b9773b9&from=serp&vjs=3",
      "description": "Elastyczne godziny pracy Pakiety i karty sportowe Work collaboratively with engineers, designers, and product managers to deliver a consistent, delightful and seamless user experience Evolve a shared React Frontend component library & design system Help define engineering best practices and build tooling for consistent state management, routing, component composition, code style & quality, as well as for CI/CD Produce high-quality results by consulting on and contributing to large cross-functional projects that have a significant impact on the business Collaborate with Backend engineers to shape future-proof interfaces that are easy to build against and meet the requirements of client-facing teams Actively mentor more junior peers Strong technical background, including 4+ years of experience building React-based SPAs or web applications with TypeScript Familiarity with Frontend build and bundling tools and how they integrate with CI/CD pipelines Skilled in collaborating with backend engineers, designers, and product managers to deliver features inline with company goals Good level of understanding CSS and the majority of its patterns, best practices, & intricacies Strong communicator: explain complex technical concepts to designers, support, and other engineers Team-bonding activities and company-wide events Flexible working hours Annual Well-being and Professional Development Stipends Private Healthcare and Multisport Pass Paid maternity and paternity leave Stock options Porady zawodowe Przeglądaj oferty pracy Wynagrodzenia Kraje O nas Centrum pomocy © 2024 Indeed Dostępność w serwisie Indeed Centrum ochrony prywatności i wybór reklam Przesyłanie zgłoszeń na mocy aktu o usługach cyfrowych Strona poświęcona bezpieczeństwu w Internecie Warunki",
      "buttontext": "aplikuj teraz",
      "easyApply": true,
      "companyName": "Senior Software Frontend Engineer - Hybrid, Poland"
    },
    {
      "id": 6,
      "href": "https://pl.indeed.com/rc/clk?jk=e1a779c3632bbee6&bb=nBiv9VFjOgI6JFVotktcpaClNy9Us9JjAU-cioeY_6ldLPYOT4I69_o2B6Syyc3JP5KfhZoGSGEnItHEIU0J9Fh4mjZLqCu74GluhUV00NJSCMv5is7AlPnSobRAiCXW&xkcb=SoBb67M370wyw5TToZ0NbzkdCdPP&fccid=746f90fe52b72e58&cmp=IT-Monks&ti=Wordpress+Developer&vjs=3",
      "title": "Senior WordPress Developer",
      "applyUrl": "https://pl.indeed.com/viewjob?cmp=IT-Monks&t=Wordpress+Developer&jk=e1a779c3632bbee6&xpse=SoBX67I370wyd5zTsR0LbzkdCdPP&xfps=db839fcd-d2e5-4136-90b5-33b4202fad14&xkcb=SoBb67M370wyw5TToZ0NbzkdCdPP&vjs=3",
      "description": "body .js-match-insights-provider-13z8r1w{align-content:center;align-items:center;border:1px solid;border-color:#f3f2f1;border-radius:0.25rem;box-sizing:border-box;display:inline-flex;font-family:\"Noto Sans\",\"Helvetica Neue\",\"Helvetica\",\"Arial\",\"Liberation Sans\",\"Roboto\",\"Noto\",sans-serif;font-size:0.75rem;font-weight:700;line-height:1.5;position:relative;padding-left:0.5rem;padding-right:0.5rem;padding-top:2px;padding-bottom:2px;background-color:#f3f2f1;color:#595959;padding:0.5rem;transition:all 200ms cubic-bezier(0.645, 0.045, 0.355, 1);}body .js-match-insights-provider-13z8r1w svg{display:block;height:18px;width:18px;color:#767676;}body .js-match-insights-provider-13z8r1w div:empty{margin:0;}body .js-match-insights-provider-13z8r1w svg{margin-left:-0.25rem;margin-right:-0.25rem;}body .js-match-insights-provider-13z8r1w:focus{outline:none;box-shadow:0 0 0 0.125rem rgb(255,255,255),0 0 0 0.1875rem rgb(37,87,167);}body .js-match-insights-provider-13z8r1w:focus:not([data-focus-visible-added]){box-shadow:none;}body .js-match-insights-provider-13z8r1w:hover{background-color:#e4e2e0;}body .js-match-insights-provider-13z8r1w:active{background-color:#d4d2d0;}body .js-match-insights-provider-g6kqeb{display:flex;align-items:center;margin-top:-0.5rem;margin-left:-0.5rem;flex-wrap:wrap;justify-content:flex-start;}body .js-match-insights-provider-g6kqeb>.ecydgvn1{margin-top:0.5rem;margin-left:0.5rem;max-width:100%;}body .js-match-insights-provider-tvvxwd{flex:0 0 auto;min-width:0;}Full-timebody .js-match-insights-provider-f0fy6x{width:1.125rem;height:1.125rem;color:inherit;} IT Monks is a vibrant mid-sized WordPress agency that delivers comprehensive digital services that drive our customers’ success. Our expertise covers: Web Design, Web Development, and Digital Promotion Services. We are passionate about crafting custom solutions that exceed client expectations and deliver exceptional results. Job Overview: We are looking for a Senior WordPress Developer with extensive experience in PHP, JavaScript (React), and Gutenberg.The ideal candidate will have strong English language skills (at least Upper-Intermediate level) and a proven track record of developing complex WordPress websites.As a Senior WordPress Developer, you will lead the development process, collaborate with cross-functional teams, and ensure the delivery of high-quality web solutions. Requirements: Proven experience as a WordPress Developer. Proficiency in PHP, JavaScript (React), HTML, CSS, and Gutenberg. Upper-Intermediate (B2) or higher level of English. Strong understanding of WordPress architecture and theme/plugin development. Experience with RESTful APIs and third-party integrations. Strong knowledge of WooCommerce Strong problem-solving skills and attention to detail. Ability to work independently and manage multiple projects simultaneously. Strong knowledge of version control systems (e.g., Git). Strong understanding of responsive design and web accessibility standards. Nice-to-Have Skills: Experience with eCommerce platforms such as Shopify. Familiarity with other JavaScript frameworks, such as Angular or Vue.js. Understanding of PHP frameworks like Laravel or Symfony. Responsibilities: Develop, customize, and maintain WordPress websites using PHP, JavaScript (React), and Gutenberg. Lead the design and implementation of new features and functionalities. Collaborate with designers, project managers, and other developers to create visually appealing and user-friendly websites. Ensure high-performance and availability of all WordPress websites. Conduct code reviews to maintain code quality and consistency. Troubleshoot and resolve website issues and bugs in a timely manner. Optimize websites for performance, speed, and SEO. Stay up-to-date with the latest industry trends and best practices in WordPress development. Mentor junior developers, providing guidance and support to help them grow. What We Offer: Competitive Salary: We provide a salary that reflects your experience and skills. Flexible Work Options: Choose to work remotely or in our comfortable office. Collaborative Environment: Join a talented, passionate team committed to excellence. Exciting Projects: Tackle challenging and innovative projects that advance web development. Comprehensive Benefits: Enjoy a benefits package including vacation days, sick leaves, and additional perks. Job Type: Full-time Application Question(s): What is your level of English proficiency? Do you have experience with React.js?Do you have experience with Gutenberg? Work Location: Hybrid remote in 31-416 Kraków Porady zawodowe Przeglądaj oferty pracy Wynagrodzenia Kraje O nas Centrum pomocy © 2024 Indeed Dostępność w serwisie Indeed Centrum ochrony prywatności i wybór reklam Przesyłanie zgłoszeń na mocy aktu o usługach cyfrowych Strona poświęcona bezpieczeństwu w Internecie Warunki",
      "buttontext": "aplikuj teraz",
      "easyApply": true,
      "companyName": "Senior WordPress Developer"
    },
    {
      "id": 9,
      "href": "https://pl.indeed.com/rc/clk?jk=8ca5dad460a571b6&bb=nBiv9VFjOgI6JFVotktcpbQHEEz-d5Xp73PkMLrtooaFDb_Q0Cp2T2hKlndbLhjDlmm_fLfYOtrd33bS-ooRnbBZz8PImuXPjfGOy3w7PQRXJNXiox4NEud-0evA0K1d&xkcb=SoCy67M370wyw5TToZ0CbzkdCdPP&fccid=5ee8f290c30e937d&vjs=3",
      "title": "QA Engineer (Junior/Mid)",
      "applyUrl": "https://pl.indeed.com/viewjob?jk=8ca5dad460a571b6&from=serp&vjs=3",
      "description": "body .js-match-insights-provider-1seqhc{align-content:center;align-items:center;border:1px solid;border-color:#e4f7e6;border-radius:0.25rem;box-sizing:border-box;display:inline-flex;font-family:\"Noto Sans\",\"Helvetica Neue\",\"Helvetica\",\"Arial\",\"Liberation Sans\",\"Roboto\",\"Noto\",sans-serif;font-size:0.75rem;font-weight:700;line-height:1.5;position:relative;padding-left:0.5rem;padding-right:0.5rem;padding-top:2px;padding-bottom:2px;background-color:#e4f7e6;color:#1f662c;padding:0.5rem;transition:all 200ms cubic-bezier(0.645, 0.045, 0.355, 1);}body .js-match-insights-provider-1seqhc svg{display:block;height:18px;width:18px;color:#2a863b;}body .js-match-insights-provider-1seqhc div:empty{margin:0;}body .js-match-insights-provider-1seqhc svg{margin-left:-0.25rem;margin-right:-0.25rem;}body .js-match-insights-provider-1seqhc:focus{outline:none;box-shadow:0 0 0 0.125rem rgb(255,255,255),0 0 0 0.1875rem rgb(37,87,167);}body .js-match-insights-provider-1seqhc:focus:not([data-focus-visible-added]){box-shadow:none;}body .js-match-insights-provider-1seqhc:hover{background-color:#c4ecc8;}body .js-match-insights-provider-1seqhc:active{background-color:#addfb3;}body .js-match-insights-provider-g6kqeb{display:flex;align-items:center;margin-top:-0.5rem;margin-left:-0.5rem;flex-wrap:wrap;justify-content:flex-start;}body .js-match-insights-provider-g6kqeb>.ecydgvn1{margin-top:0.5rem;margin-left:0.5rem;max-width:100%;}body .js-match-insights-provider-tvvxwd{flex:0 0 auto;min-width:0;}body .js-match-insights-provider-1xqhio{width:1.5rem;height:1.5rem;color:inherit;}pasujące preferencjePełny etatbody .js-match-insights-provider-f0fy6x{width:1.125rem;height:1.125rem;color:inherit;} Elastyczne godziny pracy Pakiety i karty sportowe  Szukasz stabilnej, ale dynamicznej i energicznej pracy? Chcesz robić rzeczy, które naprawdę mają znaczenie? Jesteśmy Telemedi - zaufanym partnerem w zakresie zaawansowanych rozwiązań cyfrowej opieki zdrowotnej. To, co robimy, to ostatecznie ratowanie życia. I tak, to są wielkie słowa. Ale wierzymy w nie i prowadzimy naszą działalność z myślą o tym konkretnym celu. Jako dział IT w Telemedi odpowiadamy za działanie szeregu aplikacji i serwisów obsługujących świadczenie usług e-zdrowia dla pacjentów i klientów Telemedi. Korzystamy z nowych technologii, rozwijamy swoje kompetencje, stawiamy na optymalny balans między dobrym tempem wytwarzania oprogramowania a utrzymaniem jego wysokiej jakości. Powiększamy nasz dział by móc tworzyć więcej, szybciej i lepiej - zarówno pod kątem biznesowym, jak i technicznym. Poszukujemy QA Engineer’ów (poziom Junior i Mid), testujących manualnie i mających pewne doświadczenie w pisaniu testów automatycznych. Szczególnie szukamy osób znających zagadnienia aplikacji web, chcących rozwijać się w obszarze QA, i posiadających już jakieś doświadczenie komercyjne.  Twoje zadania: testowanie funkcjonalne manualne aplikacji web i mobile (głównie web), m.in. testy funkcjonalne, retesty oraz smoke testy przygotowanie dokumentacji: projektowych, zestawów scenariuszy testowych, oraz tworzenie raportów po testach udział w rozwoju i utrzymaniu testów automatycznych end-to-end (Playwright) udział w rozwoju i utrzymaniu testów automatycznych API (Postman) wsparcie QA w obszarze tzw. Service Desk (zgłoszeń od klientów/użytkowników) ścisła współpraca z zespołem developerskim Requirements  Czego oczekujemy: Dobrego rozumienia mechanizmów działania nowoczesnych aplikacji web (HTTP, API, działanie przeglądarki) Doświadczenia w przeprowadzaniu testów funkcjonalnych Umiejętności pisania testów automatycznych E2E lub API, w dowolnym języku Dobrego wyczucia dot. koniecznego poziomu szczegółowości testów i tworzonego po testach raportu Umiejętności pisania prostych zapytań SQL do baz danych Ownershipu - samodzielności i odpowiedzialności za powierzone zadania Umiejętności pracy w zespole i dobrej priorytetyzacji zadań Płynnej znajomość języka polskiego Znajomości języka angielskiego pozwalająca na czytanie dokumentacji  Mile widziane: Praktyczna znajomość Playwright Znajomość jakiegokolwiek języka programowania Doświadczenie w pracy w zespołach deweloperskich (powyżej 5 osób) Doświadczenie komercyjne w rozwoju rozbudowanych zestawów testów automatycznych (zarówno API jak i end-to-end) Znajomość zagadnień z branży: medycznej, ubezpieczeniowej lub assistance Praktyczna znajomość systemu kontroli wersji Git certyfikat ISTQB  Pracujemy z nowymi technologiami: Testy: Playwright + TypeScript, Postman API testing, QA manualne Aplikacje: PHP (Symfony), React.js + TypeScript Infrastruktura: Google Cloud Platform Issue Tracker: JIRA, Confluence Build (CI): Docker, Github Actions Kontrola wersji: Github Komunikator: Slack (w tym dużo integracji ze Slackiem) Benefits Konkurencyjne wynagrodzenie adekwatne do Twojego doświadczenia i umiejętności: 7 000 - 12 000 zł netto + VAT (umowa B2B, ew. zlecenie) - rozliczenie godzinowe. Praca full zdalnie, ew. hybrydowo lub stacjonarnie z biura w Warszawie. Elastyczne godziny pracy Możliwość zdobycia unikalnego doświadczenia w dynamicznym, innowacyjnym środowisku startupowym na szybko rozwijającym się rynku. Karta Multisport. Nieograniczony dostęp do usług telemedycznych.  Co wyróżni Cię spośród innych kandydatów: Twoja zdolność do myślenia poza schematami Komunikatywność - jasna, klarowna i rzeczowa  Etapy procesu rekrutacyjnego: krótki quiz - test wiedzy online (10 min) krótkie video interview online (ok. 10-15min) zadanie techniczne ew. Assessment Day dla wybranych kandydatów.  Dzięki takim etapom rekrutacji nie wymagamy dużego zaangażowania czasowego na początku, proces rekrutacyjny idzie sprawnie (feedback dostajesz szybko!) oraz możemy dać szansę szerszemu gronu kandydatów.  Jeżeli uważasz, że jesteś właściwą osobą do tego stanowiska, skontaktuj się z nami i dołącz do zespołu, który naprawdę robi różnicę! W swoim CV pokaż nam, że jesteś komandosem, którego szukamy.  Nie zwlekaj, dołącz do nas już dziś!  Porady zawodowe Przeglądaj oferty pracy Wynagrodzenia Kraje O nas Centrum pomocy © 2024 Indeed Dostępność w serwisie Indeed Centrum ochrony prywatności i wybór reklam Przesyłanie zgłoszeń na mocy aktu o usługach cyfrowych Strona poświęcona bezpieczeństwu w Internecie Warunki",
      "buttontext": "aplikuj teraz",
      "easyApply": true,
      "companyName": "QA Engineer (Junior/Mid)"
    },
    {
      "id": 10,
      "href": "https://pl.indeed.com/rc/clk?jk=114c1db42eb5bbef&bb=nBiv9VFjOgI6JFVotktcpRTq2HkD5aowGve2jC499mRAlJpbWlOt5CVLnZCjmg_pW0Gt5XnQvUvAZKQmBAMrO20RKl-59fFWgDat5mb4cSS5iez30z1shAp5v7JOHFza&xkcb=SoAv67M370wyw5TToZ0BbzkdCdPP&fccid=472971ece0ef611d&vjs=3",
      "title": "Senior React Developer - EU/Brazil",
      "applyUrl": "https://pl.indeed.com/viewjob?jk=114c1db42eb5bbef&from=serp&vjs=3",
      "description": "body .js-match-insights-provider-1seqhc{align-content:center;align-items:center;border:1px solid;border-color:#e4f7e6;border-radius:0.25rem;box-sizing:border-box;display:inline-flex;font-family:\"Noto Sans\",\"Helvetica Neue\",\"Helvetica\",\"Arial\",\"Liberation Sans\",\"Roboto\",\"Noto\",sans-serif;font-size:0.75rem;font-weight:700;line-height:1.5;position:relative;padding-left:0.5rem;padding-right:0.5rem;padding-top:2px;padding-bottom:2px;background-color:#e4f7e6;color:#1f662c;padding:0.5rem;transition:all 200ms cubic-bezier(0.645, 0.045, 0.355, 1);}body .js-match-insights-provider-1seqhc svg{display:block;height:18px;width:18px;color:#2a863b;}body .js-match-insights-provider-1seqhc div:empty{margin:0;}body .js-match-insights-provider-1seqhc svg{margin-left:-0.25rem;margin-right:-0.25rem;}body .js-match-insights-provider-1seqhc:focus{outline:none;box-shadow:0 0 0 0.125rem rgb(255,255,255),0 0 0 0.1875rem rgb(37,87,167);}body .js-match-insights-provider-1seqhc:focus:not([data-focus-visible-added]){box-shadow:none;}body .js-match-insights-provider-1seqhc:hover{background-color:#c4ecc8;}body .js-match-insights-provider-1seqhc:active{background-color:#addfb3;}body .js-match-insights-provider-g6kqeb{display:flex;align-items:center;margin-top:-0.5rem;margin-left:-0.5rem;flex-wrap:wrap;justify-content:flex-start;}body .js-match-insights-provider-g6kqeb>.ecydgvn1{margin-top:0.5rem;margin-left:0.5rem;max-width:100%;}body .js-match-insights-provider-tvvxwd{flex:0 0 auto;min-width:0;}body .js-match-insights-provider-1xqhio{width:1.5rem;height:1.5rem;color:inherit;}pasujące preferencjePełny etatbody .js-match-insights-provider-f0fy6x{width:1.125rem;height:1.125rem;color:inherit;} At Sybill.ai, we are building a 10x better way to do B2B sales via an end-to-end, AI-first GTM stack that unlocks unprecedented levels of automation for the sales reps. The existing GTM stack only gives reps a better UX to do their admin tasks. With Sybill, reps will not need to do them at all. All they will need to do is take customer calls and supervise the AI, enabling them to be super-sellers. Our founding team from Stanford, Harvard and IITs has built a sales-specific, proprietary AI to extract highly accurate deal attributes, which unlocks these workflows. This AI-first GTM stack will disrupt both today's pigeonholed tools (Gong, Highspot, Scratchpad, Clari, Outreach) and remove the need for extensive middle management in GTM orgs. With Sybill's conversational AI workflows, reps are seeing a remarkable behavior switch in their day-to-day and they just can't stop using the product (gross retention - 99%+). They are vocal about their love for Sybill on LinkedIn, enabling us to grow 20x to $1.2M in ARR last year. We are seeking an experienced and highly skilled Sr. React Developer to join our growing engineering team. As a Sr. React Developer, you will play a crucial role in designing, developing, and maintaining web applications using modern React practices. You will be part of a global team, collaborating across time zones, and ensuring the delivery of high-quality, scalable front-end solutions. We strongly believe in continuously improving our architecture and take advantage of powerful tools such as Copilot and Cursor to deliver a great product to our customers. The ideal candidate is based in Europe or Brazil and possesses deep expertise in React, front-end development best practices, and the ability to architect efficient solutions in a fast-paced, agile environment. This role requires someone who can lead front-end development efforts, mentor junior developers, and work closely with backend engineers to deliver robust, responsive, and user-friendly applications.  Lead the development of web applications using React and related technologies. Collaborate with cross-functional teams, including designers, product managers, and backend developers, to ensure a seamless user experience. Translate wireframes, prototypes, and UI/UX designs into responsive, high-performance React components. Optimize applications for maximum speed, scalability, and accessibility. Architect and develop reusable, modular, and maintainable components. Troubleshoot and resolve complex technical issues, providing solutions that scale. Mentor and provide guidance to junior developers, promoting code quality and best practices. Participate in code reviews, ensuring adherence to coding standards and best practices. Stay up-to-date with the latest trends and advancements in React and front-end development, continuously improving the team's development processes. Work in an Agile/Scrum environment, contributing to sprints, planning, and estimation sessions.  5+ years of experience in front-end development. 3+ years of hands-on experience with React (Hooks, Redux, etc.). Proven experience in architecting, developing, and maintaining complex web applications in a production environment. Strong understanding of state management, component lifecycle, and front-end performance optimization techniques. Familiarity with modern JavaScript (ES Next), TypeScript, and front-end build tools such as Vite. Solid understanding of HTTP APIs and integration with backend services. Experience with testing frameworks like Vitest and Playwright. Knowledge of version control systems such as Git and experience working in a collaborative code environment (e.g., GitHub, BitBucket). Familiarity with CI/CD pipelines and deployment automation tools. Strong communication skills and the ability to work effectively in a distributed, remote-first team. Ability to work in a fast-paced, Agile environment, meeting deadlines and adapting to changing priorities.  Experience in building SPA with React. Exposure to Node.js or full-stack development. Understanding of Docker or containerization technologies. Experience working in globally distributed teams across time zones. Previous experience leading or mentoring a team of developers. Porady zawodowe Przeglądaj oferty pracy Wynagrodzenia Kraje O nas Centrum pomocy © 2024 Indeed Dostępność w serwisie Indeed Centrum ochrony prywatności i wybór reklam Przesyłanie zgłoszeń na mocy aktu o usługach cyfrowych Strona poświęcona bezpieczeństwu w Internecie Warunki",
      "buttontext": "aplikuj teraz",
      "easyApply": true,
      "companyName": "Senior React Developer - EU/Brazil"
    },
    {
      "id": 14,
      "href": "https://pl.indeed.com/rc/clk?jk=ffeca0f30e15c70b&bb=nBiv9VFjOgI6JFVotktcpX6YFnyaePoWVgI1gtDQSyM7rwq14R5gtnalUpv4rnHrI4wjiqnXiRT2B0csOB16R9OdU1bvDBuYuDOwMn8Yvj0TMh4wrvYGspmYjII2Y-pt&xkcb=SoA867M370wyw5TToZ0FbzkdCdPP&fccid=471c029c5a139d2e&vjs=3",
      "title": "Senior Full-stack (React + Java) Developer",
      "applyUrl": "https://pl.indeed.com/viewjob?jk=ffeca0f30e15c70b&from=serp&vjs=3",
      "description": "body .js-match-insights-provider-1seqhc{align-content:center;align-items:center;border:1px solid;border-color:#e4f7e6;border-radius:0.25rem;box-sizing:border-box;display:inline-flex;font-family:\"Noto Sans\",\"Helvetica Neue\",\"Helvetica\",\"Arial\",\"Liberation Sans\",\"Roboto\",\"Noto\",sans-serif;font-size:0.75rem;font-weight:700;line-height:1.5;position:relative;padding-left:0.5rem;padding-right:0.5rem;padding-top:2px;padding-bottom:2px;background-color:#e4f7e6;color:#1f662c;padding:0.5rem;transition:all 200ms cubic-bezier(0.645, 0.045, 0.355, 1);}body .js-match-insights-provider-1seqhc svg{display:block;height:18px;width:18px;color:#2a863b;}body .js-match-insights-provider-1seqhc div:empty{margin:0;}body .js-match-insights-provider-1seqhc svg{margin-left:-0.25rem;margin-right:-0.25rem;}body .js-match-insights-provider-1seqhc:focus{outline:none;box-shadow:0 0 0 0.125rem rgb(255,255,255),0 0 0 0.1875rem rgb(37,87,167);}body .js-match-insights-provider-1seqhc:focus:not([data-focus-visible-added]){box-shadow:none;}body .js-match-insights-provider-1seqhc:hover{background-color:#c4ecc8;}body .js-match-insights-provider-1seqhc:active{background-color:#addfb3;}body .js-match-insights-provider-g6kqeb{display:flex;align-items:center;margin-top:-0.5rem;margin-left:-0.5rem;flex-wrap:wrap;justify-content:flex-start;}body .js-match-insights-provider-g6kqeb>.ecydgvn1{margin-top:0.5rem;margin-left:0.5rem;max-width:100%;}body .js-match-insights-provider-tvvxwd{flex:0 0 auto;min-width:0;}body .js-match-insights-provider-1xqhio{width:1.5rem;height:1.5rem;color:inherit;}pasujące preferencjePełny etatbody .js-match-insights-provider-f0fy6x{width:1.125rem;height:1.125rem;color:inherit;} Służbowe urządzenia mobilne Intellectsoft is a digital transformation consultancy that provides cutting edge engineering solutions for global organizations. Our mission is to help enterprises accelerate adoption of new technologies, untangle complex issues that always emerge during digital evolution, and orchestrate ongoing innovation. Established in 2007, the company is headquartered in New York and operates in multiple offices and engineering centers in the US, the UK, the Nordic region and Eastern Europe. Our main focus is on new and emerging technologies, such as Cognitive Computing, Decentralized Applications, and Internet-of-Things. Among our clients are globally recognized brand names, such as Universal Pictures, Jaguar Motors, Qualcomm, Ernst & Young, Clinique, Bombardier, London Stock Exchange, Harley-Davidson and many others. For more information please visit our website www.intellectsoft.net. A biotechnology research project that earned recognition as a trusted provider of clinical genetic testing and an ideal collaborator for developing precision medicine solutions. Patients are central to the project's mission, driving partnerships with numerous non-profit organizations to support patients and healthcare professionals in their quest for answers. The main focus - is Clinical Cancer Diagnostic; however, the project is designed to expand into additional areas such as Molecular Diagnostic Testing, Cardio Genetics, Neuro Genetics, etc Requirements 5+ years of experience in React and Java development. Strong proficiency in JavaScript, HTML5, CSS3. Strong knowledge of TypeScript and its application in React projects. Experience with modern state management libraries (e.g., Redux, MobX, Context API). Expertise in Spring Framework, including modules like Spring Core, Spring Web (MVC), Spring Security, Spring ORM, and Spring JDBC. Experience with Google Web Toolkit (GWT) and its related dependencies (e.g., gwt-user, gwt-servlet). Familiarity with Jersey for building RESTful web services (jersey-spring5, javax.ws.rs). Proficiency in Hibernate for ORM (Object-Relational Mapping). Experience with AspectJ for aspect-oriented programming (aspectjweaver, aspectjrt). Experience with build tools (Webpack, Babel, etc.). Strong problem-solving skills and attention to detail. Excellent communication and team collaboration skills. Proficient understanding of Git version control. Familiarity with WebSockets and real-time data handling. Experience with CI/CD pipelines (e.g., Jenkins, CircleCI). Knowledge of cloud platforms like AWS, Azure, or Google Cloud. Understanding of Docker and containerization. Experience with performance tuning and optimization tools Develop and maintain high-performance, scalable web applications using React.js and Java with the Spring Framework. Lead the architecture, design, and implementation of new features using Spring and related technologies. Collaborate with UI/UX designers to create visually appealing and user-friendly interfaces. Optimize applications for maximum speed and scalability. Ensure the technical feasibility of UI/UX designs. Integrate front-end applications with Java back-end services. Build and maintain RESTful web services using Jersey. Conduct code reviews, maintain coding standards, and ensure high-quality code. Mentor and guide junior developers on best practices and coding techniques. Troubleshoot and resolve complex technical issues. Stay updated on emerging technologies and incorporate them into development processes. Benefits 35 paid absence days per year for work-life balance of each specialist + 1 additional day for each following year of cooperation with the company Up to 15 unused absence days can be add to income after 12 month of cooperation Health insurance for you Depreciation coverage for personal laptop usage for project needs Udemy courses of your choice Regular soft-skills trainings Excellence Сenters meetups  Porady zawodowe Przeglądaj oferty pracy Wynagrodzenia Kraje O nas Centrum pomocy © 2024 Indeed Dostępność w serwisie Indeed Centrum ochrony prywatności i wybór reklam Przesyłanie zgłoszeń na mocy aktu o usługach cyfrowych Strona poświęcona bezpieczeństwu w Internecie Warunki",
      "buttontext": "aplikuj teraz",
      "easyApply": true,
      "companyName": "Senior Full-stack (React + Java) Developer"
    }
  ]
]