[
  [
    {
      "id": 0,
      "href": "https://pl.indeed.com/rc/clk?jk=c53cddf643fd77e6&bb=nBiv9VFjOgI6JFVotktcpcJ_HonrtHDy62xts3b68LPwMfep5yIwuXPG0HrPBK0Jsd_tCF_O41eJd5pB2PL4Nq1gXJ7V5hfziBT1rSq1WYtb1BLBWdFH5A%3D%3D&xkcb=SoBh67M370wyw5TToZ0LbzkdCdPP&fccid=aef928e89977f7f0&vjs=3",
      "title": "Junior Software Engineer",
      "applyUrl": "https://pl.indeed.com/viewjob?jk=c53cddf643fd77e6&from=serp&vjs=3",
      "description": "Możliwość pracy z domu  Note: Base Pay Range Poland Base Pay: PLN 136,000.00 - 187,000.00 per year Splunk provides flexibility and choice in the working arrangement for most roles, including remote and/or in-office roles. We have a market-based pay structure which varies by location. Please note that the base pay range is a guideline and for candidates who receive an offer, the base pay will vary based on factors such as work location as set out above, as well as the knowledge, skills and experience of the candidate. In addition to base pay, this role is eligible for incentive compensation and may be eligible for equity or long-term cash awards. Porady zawodowe Przeglądaj oferty pracy Wynagrodzenia Kraje O nas Centrum pomocy © 2024 Indeed Dostępność w serwisie Indeed Centrum ochrony prywatności i wybór reklam Przesyłanie zgłoszeń na mocy aktu o usługach cyfrowych Strona poświęcona bezpieczeństwu w Internecie Warunki",
      "buttontext": "aplikacja w witrynie firmy",
      "easyApply": false,
      "companyName": "Junior Software Engineer"
    },
    {
      "id": 1,
      "href": "https://pl.indeed.com/rc/clk?jk=58e920253ad1595e&bb=nBiv9VFjOgI6JFVotktcpXFWMKOGM38FBSOHHILFKGB6j1l5JqfvkwuYsYY9wtRr4QSWcjCN6qTA2Uj1-ElQHE2LOtVgbEJjcWR9JVR8dgeKUWZY1NA6dpKn-y7j3BW2&xkcb=SoDV67M370wyw5TToZ0KbzkdCdPP&fccid=455ed1132d0b8a44&vjs=3",
      "title": "Junior Frontend Developer",
      "applyUrl": "https://pl.indeed.com/viewjob?jk=58e920253ad1595e&from=serp&vjs=3",
      "description": "body .js-match-insights-provider-1seqhc{align-content:center;align-items:center;border:1px solid;border-color:#e4f7e6;border-radius:0.25rem;box-sizing:border-box;display:inline-flex;font-family:\"Noto Sans\",\"Helvetica Neue\",\"Helvetica\",\"Arial\",\"Liberation Sans\",\"Roboto\",\"Noto\",sans-serif;font-size:0.75rem;font-weight:700;line-height:1.5;position:relative;padding-left:0.5rem;padding-right:0.5rem;padding-top:2px;padding-bottom:2px;background-color:#e4f7e6;color:#1f662c;padding:0.5rem;transition:all 200ms cubic-bezier(0.645, 0.045, 0.355, 1);}body .js-match-insights-provider-1seqhc svg{display:block;height:18px;width:18px;color:#2a863b;}body .js-match-insights-provider-1seqhc div:empty{margin:0;}body .js-match-insights-provider-1seqhc svg{margin-left:-0.25rem;margin-right:-0.25rem;}body .js-match-insights-provider-1seqhc:focus{outline:none;box-shadow:0 0 0 0.125rem rgb(255,255,255),0 0 0 0.1875rem rgb(37,87,167);}body .js-match-insights-provider-1seqhc:focus:not([data-focus-visible-added]){box-shadow:none;}body .js-match-insights-provider-1seqhc:hover{background-color:#c4ecc8;}body .js-match-insights-provider-1seqhc:active{background-color:#addfb3;}body .js-match-insights-provider-g6kqeb{display:flex;align-items:center;margin-top:-0.5rem;margin-left:-0.5rem;flex-wrap:wrap;justify-content:flex-start;}body .js-match-insights-provider-g6kqeb>.ecydgvn1{margin-top:0.5rem;margin-left:0.5rem;max-width:100%;}body .js-match-insights-provider-tvvxwd{flex:0 0 auto;min-width:0;}body .js-match-insights-provider-1xqhio{width:1.5rem;height:1.5rem;color:inherit;}pasujące preferencjePełny etatbody .js-match-insights-provider-f0fy6x{width:1.125rem;height:1.125rem;color:inherit;} body .js-match-insights-provider-13z8r1w{align-content:center;align-items:center;border:1px solid;border-color:#f3f2f1;border-radius:0.25rem;box-sizing:border-box;display:inline-flex;font-family:\"Noto Sans\",\"Helvetica Neue\",\"Helvetica\",\"Arial\",\"Liberation Sans\",\"Roboto\",\"Noto\",sans-serif;font-size:0.75rem;font-weight:700;line-height:1.5;position:relative;padding-left:0.5rem;padding-right:0.5rem;padding-top:2px;padding-bottom:2px;background-color:#f3f2f1;color:#595959;padding:0.5rem;transition:all 200ms cubic-bezier(0.645, 0.045, 0.355, 1);}body .js-match-insights-provider-13z8r1w svg{display:block;height:18px;width:18px;color:#767676;}body .js-match-insights-provider-13z8r1w div:empty{margin:0;}body .js-match-insights-provider-13z8r1w svg{margin-left:-0.25rem;margin-right:-0.25rem;}body .js-match-insights-provider-13z8r1w:focus{outline:none;box-shadow:0 0 0 0.125rem rgb(255,255,255),0 0 0 0.1875rem rgb(37,87,167);}body .js-match-insights-provider-13z8r1w:focus:not([data-focus-visible-added]){box-shadow:none;}body .js-match-insights-provider-13z8r1w:hover{background-color:#e4e2e0;}body .js-match-insights-provider-13z8r1w:active{background-color:#d4d2d0;}Kontrakt B2B Pakiety i karty sportowe Prywatna opieka medyczna  We are seeking a dedicated and talented individual to join our team as a Junior Frontend Developer. In this role, you will be an integral member of our product team, which specializes in developing applications for Monday.com using the monday-code framework. You will primarily work with a modern tech stack including React with TypeScript for the user interface, Node.js with Express for backend operations, GraphQL for backend communication, and Zustand for frontend state management. Your daily responsibilities will include writing clean and efficient code as per specifications, troubleshooting and debugging existing software, and identifying, prioritizing, and executing tasks within the software development life cycle. Our company is an industry leader renowned for its expertise in developing applications for Jira, holding the prestigious status of Atlassian’s Platinum Marketplace Partner. As we expand into new markets such as Monday.com, we continue to foster an environment that values innovation, collaboration, and excellence. Our team is comprised of specialists across various roles including developers, designers, customer care specialists, and Product Owners, all of whom are committed to delivering top-tier solutions. We pride ourselves on our inclusive and growth-oriented culture, along with our commitment to providing high-quality products and services. Graduate or final-year student in Computer Studies or a related field. Full-time availability. Proficiency in English. Solid understanding of React; experience with TypeScript is advantageous. Motivation to enhance frontend and interpersonal skills. Competitive salary range Comprehensive benefits package (12 000 PLN yearly for certificates & trainings; MultiSport card; Amazon Kindle + 150 PLN quarterly for e-books; 150 PLN quarterly for cultural & sports activities; Private medical care; Languages lessons; etc.) Opportunities for professional development and career growth Flexible working arrangements Supportive and collaborative work environment Initial Application: Submit your application through our online form. Screening: Our recruitment team will review your application to ensure you meet the basic requirements. Telephone Interview: A preliminary conversation to discuss your experience and suitability for the role + tasks. Preliminary Acceptance: If successful, you will move forward to the technical verification stage. Technical Verification: An in-depth assessment of your technical skills and knowledge. Offer: Successful candidates will receive a formal job offer.   Our specialists are waiting to get in touch with you.  mchomicz@soldevelo.com Porady zawodowe Przeglądaj oferty pracy Wynagrodzenia Kraje O nas Centrum pomocy © 2024 Indeed Dostępność w serwisie Indeed Centrum ochrony prywatności i wybór reklam Przesyłanie zgłoszeń na mocy aktu o usługach cyfrowych Strona poświęcona bezpieczeństwu w Internecie Warunki",
      "buttontext": "aplikacja w witrynie firmy",
      "easyApply": false,
      "companyName": "Junior Frontend Developer"
    },
    {
      "id": 2,
      "href": "https://pl.indeed.com/rc/clk?jk=8703e7e6a9fcceca&bb=nBiv9VFjOgI6JFVotktcpW6gcbhxuSGhqFjFxuQIV3WyID6qec9m83BX5SaSrqVaf4N8cInofNNkVyxUG7Nle27InHXBxEgMh0F3G5RAnw5-O6NWzu0b_LeqmNPMwvlS&xkcb=SoBI67M370wyw5TToZ0JbzkdCdPP&fccid=93143575209a3ce4&vjs=3",
      "title": "Front-End Lead (Angular, Remote)",
      "applyUrl": "https://pl.indeed.com/viewjob?jk=8703e7e6a9fcceca&from=serp&vjs=3",
      "description": "Position Summary: We are looking for a skilled and experienced Front-End Lead to join our team. This is a remote role, with the flexibility to consider applications from anywhere in Europe. As part of our Front-end guild, you will be responsible for leading the design and development of front-end applications that drive our platform's user experience. Your role will span the complete front-end stack, including Angular, TypeScript, WordPress, and Webflow, helping shape the future of our web interface and user interactions.  Duties and responsibilities: Lead the front-end development team, establishing best practices and maintaining high-quality standards. Design and implement user interfaces using Angular and TypeScript. Integrate front-end solutions with back-end APIs and services. Work closely with design and product teams to translate UI/UX wireframes into working applications. Ensure cross-browser compatibility, performance optimisation, and responsive design. Manage, customise, and maintain WordPress and Webflow for various content management purposes. Mentor and guide junior developers, providing code reviews, technical feedback, and support. Maintain and improve code quality by adhering to design principles and coding standards. Stay updated with emerging front-end trends and technologies, continuously enhancing our stack. Requirements and qualifications: 8+ years of professional experience in front-end development. 5+ years expertise in Angular and TypeScript, with a deep understanding of front-end architectures. Proficiency with HTML5, CSS3, JavaScript, and modern web development practices. Experience with WordPress and Webflow for CMS-based solutions. Strong experience in front-end testing: Unit testing using Karma and Jasmine. End-to-end testing using Playwright. Proven leadership skills with experience in managing teams and mentoring junior engineers. Ability to work independently and deliver end-to-end solutions. Solid understanding of UI/UX principles and ability to collaborate effectively with design teams. Strong problem-solving skills and attention to detail. Experience with Agile methodologies and working in a startup environment. Would be a plus: Experience with back-end technologies (e.g., Node.js or Python) for full-stack contributions. Familiarity with SEO optimisation techniques and tools. Experience with React. Experience with migrating front-end projects from frameworks like Angular or Vue.js to React. Experience with hybrid mobile technologies (e.g., React Native or Flutter) Passion for blockchain and cryptocurrency technologies. Open-source contributions or involvement in developer communities. Experience in teaching, mentoring, or creating technical content (blogs, tutorials, talks). Experience creating educational materials or speaking at conferences. Porady zawodowe Przeglądaj oferty pracy Wynagrodzenia Kraje O nas Centrum pomocy © 2024 Indeed Dostępność w serwisie Indeed Centrum ochrony prywatności i wybór reklam Przesyłanie zgłoszeń na mocy aktu o usługach cyfrowych Strona poświęcona bezpieczeństwu w Internecie Warunki",
      "buttontext": "aplikacja w witrynie firmy",
      "easyApply": false,
      "companyName": "Front-End Lead (Angular, Remote)"
    },
    {
      "id": 3,
      "href": "https://pl.indeed.com/rc/clk?jk=b6408b4dd94fff16&bb=nBiv9VFjOgI6JFVotktcpbZt8Bo1kZ4MCurCkW1f7EUQA2X9EcQ4Aj_EV5tJkGUR2zckQJ_Omphfx4iTI9D2KgXg-du02Xt7lOsX-_mKV2mHf3llSGvhX9Panpbj4C1c&xkcb=SoD867M370wyw5TToZ0IbzkdCdPP&fccid=722cda5c93faaf77&vjs=3",
      "title": "Junior .NET Developer",
      "applyUrl": "https://pl.indeed.com/viewjob?jk=b6408b4dd94fff16&from=serp&vjs=3",
      "description": "Summary The international IT сompany Andersen invites a Junior .NET Developer to join our dynamic and highly skilled professional team. Andersen is a pre-IPO software development company that provides a full cycle of services, following project management standards and best practices. For over 17 years, we have been helping enterprises and middle-sized firms transform their businesses by creating effective digital solutions using innovative technologies. Immerse yourself in a global landscape as we collaborate with enterprises spanning North America, Western Europe, Israel, Australia, and the UAE. Our diverse expertise extends across FinTech, Healthcare, Retail, Telecom, Media & Entertainment, Logistics, Travel & Hospitality, eCommerce, and more. We are looking for a Junior .NET Developer to join our company, known for its innovative projects and commitment to quality. You will be involved in the development of applications and contribute to creating something amazing. Technology stack: .NET, Entity Framework, Docker, Azure, SQL Server, Micro Services. Requirements Experience as a .NET Developer for 1+ years. Experience with Entity Framework. Proficiency in building and deploying containerized applications using Docker. Experience with cloud services, preferably Azure. Understanding of SQL Server and database principles. Knowledge of Microservices architecture and design. Excellent troubleshooting and communication skills. Ability to work in a fast-paced, team-oriented environment. Level of English – from Intermediate and above. Desired skills Experience with front-end development (React or Angular). Familiarity with Kafka, Kubernetes, and Jenkins. knowledge matrix Reasons to join us Experience in teamwork with leaders in FinTech, Healthcare, Retail, Telecom, and others. Andersen cooperates with such businesses as Samsung, Siemens, Johnson & Johnson, BNP Paribas, Ryanair, Mercedes, TUI, Verivox, Allianz, T-Systems, etc.. The opportunity to change the project and/or develop expertise in an interesting business domain. Job conditions – you can work both fully remotely and from the office or can choose a hybrid variant. Guarantee of professional, financial, and career growth! The company has introduced systems of mentoring and adaptation for each new employee. The opportunity to earn additional up to 1,700 EUR per month by participating in the company's activities. Access to the corporate training portal, where the entire knowledge base of the company is collected and which is constantly updated. Bright corporate life (parties / pizza days / PlayStation / fruits / coffee / snacks / movies). Certification compensation (AWS, PMP, etc). Referral program. English courses. Private health insurance and compensation for sports activities. Join us! Porady zawodowe Przeglądaj oferty pracy Wynagrodzenia Kraje O nas Centrum pomocy © 2024 Indeed Dostępność w serwisie Indeed Centrum ochrony prywatności i wybór reklam Przesyłanie zgłoszeń na mocy aktu o usługach cyfrowych Strona poświęcona bezpieczeństwu w Internecie Warunki",
      "buttontext": "aplikacja w witrynie firmy",
      "easyApply": false,
      "companyName": "Junior .NET Developer"
    },
    {
      "id": 4,
      "href": "https://pl.indeed.com/rc/clk?jk=6dfb8795a4de85a8&bb=nBiv9VFjOgI6JFVotktcpR_qa3LIs3-V6PhJTmUBk68H2MP_y64ptJIveZI6F5TBjPX_OoZeRb9_QE99X40wwX8nAYlyQdEaqEYlorOiy_r3dp1qtjVjvMxtz3nFok8v&xkcb=SoBy67M370wyw5TToZ0PbzkdCdPP&fccid=b12fef3afdfea408&vjs=3",
      "title": "Senior Frontend Developer",
      "applyUrl": "https://pl.indeed.com/viewjob?jk=6dfb8795a4de85a8&from=serp&vjs=3",
      "description": "body .js-match-insights-provider-1seqhc{align-content:center;align-items:center;border:1px solid;border-color:#e4f7e6;border-radius:0.25rem;box-sizing:border-box;display:inline-flex;font-family:\"Noto Sans\",\"Helvetica Neue\",\"Helvetica\",\"Arial\",\"Liberation Sans\",\"Roboto\",\"Noto\",sans-serif;font-size:0.75rem;font-weight:700;line-height:1.5;position:relative;padding-left:0.5rem;padding-right:0.5rem;padding-top:2px;padding-bottom:2px;background-color:#e4f7e6;color:#1f662c;padding:0.5rem;transition:all 200ms cubic-bezier(0.645, 0.045, 0.355, 1);}body .js-match-insights-provider-1seqhc svg{display:block;height:18px;width:18px;color:#2a863b;}body .js-match-insights-provider-1seqhc div:empty{margin:0;}body .js-match-insights-provider-1seqhc svg{margin-left:-0.25rem;margin-right:-0.25rem;}body .js-match-insights-provider-1seqhc:focus{outline:none;box-shadow:0 0 0 0.125rem rgb(255,255,255),0 0 0 0.1875rem rgb(37,87,167);}body .js-match-insights-provider-1seqhc:focus:not([data-focus-visible-added]){box-shadow:none;}body .js-match-insights-provider-1seqhc:hover{background-color:#c4ecc8;}body .js-match-insights-provider-1seqhc:active{background-color:#addfb3;}body .js-match-insights-provider-g6kqeb{display:flex;align-items:center;margin-top:-0.5rem;margin-left:-0.5rem;flex-wrap:wrap;justify-content:flex-start;}body .js-match-insights-provider-g6kqeb>.ecydgvn1{margin-top:0.5rem;margin-left:0.5rem;max-width:100%;}body .js-match-insights-provider-tvvxwd{flex:0 0 auto;min-width:0;}body .js-match-insights-provider-1xqhio{width:1.5rem;height:1.5rem;color:inherit;}pasujące preferencjePełny etatbody .js-match-insights-provider-f0fy6x{width:1.125rem;height:1.125rem;color:inherit;} Elastyczne godziny pracy  Responsibilities: You will be responsible for the development and maintenance of Central Europe’s largest workshop search platform, with a focus on both frontend and backend architecture. Design and implement a clean, high-performance frontend architecture using technologies like React, TypeScript, and Tailwind CSS. Work with the latest technologies, including Next.js (with App Router) and Turbopack, ensuring the platform remains modern and highly performant. Develop and maintain server-side logic, focusing on scalable and efficient solutions using Next.js, Node.js, and GraphQL. Participate in strategic technical decision-making, collaborating closely with teammates. Conduct code reviews, share best practices, mentor junior developers, and help foster a collaborative, fun, and open-minded team culture. Requirements: At least 3 years of hands-on experience with React and its ecosystem. Strong experience with Server-Side Rendering (SSR) using the latest Next.js and Node.js. Proficiency with GraphQL for querying and manipulating APIs. Familiarity with Playwright for end-to-end testing of web applications. Knowledge of Tailwind CSS for modern and maintainable styling. Experience working with or contributing to a design system will be a strong advantage. Ability to clearly communicate and discuss ideas & concepts with the team. Basic knowledge of Docker and Kubernetes for containerization and orchestration. Experience in technical mentoring and code reviews. What we offer: Work on interesting projects in the field of digital transformation at a large European organization Participation in international projects Remote work High independence and the opportunity to implement your own ideas. Highly motivated and engaged team with strong technical competences Flexible employment arrangements, such as flexible hours and partial remote work Training and personal development opportunities.  Porady zawodowe Przeglądaj oferty pracy Wynagrodzenia Kraje O nas Centrum pomocy © 2024 Indeed Dostępność w serwisie Indeed Centrum ochrony prywatności i wybór reklam Przesyłanie zgłoszeń na mocy aktu o usługach cyfrowych Strona poświęcona bezpieczeństwu w Internecie Warunki",
      "buttontext": "aplikacja w witrynie firmy",
      "easyApply": false,
      "companyName": "Senior Frontend Developer"
    },
    {
      "id": 7,
      "href": "https://pl.indeed.com/rc/clk?jk=00c5fb195d50008f&bb=nBiv9VFjOgI6JFVotktcpcJtsJBz1qAu6qKeqOIaZFXqXYrpikQz0qkJltUvi8MJwFRNodXuK0vw3oZOL89IIRx4V41uwvjTeWqZendDBPweQcAf-Gjnm6oFXY8kZgur&xkcb=SoDv67M370wyw5TToZ0MbzkdCdPP&fccid=b48442910bb69b13&vjs=3",
      "title": "Junior Live Operations Specialist",
      "applyUrl": "https://pl.indeed.com/viewjob?jk=00c5fb195d50008f&from=serp&vjs=3",
      "description": "body .js-match-insights-provider-13z8r1w{align-content:center;align-items:center;border:1px solid;border-color:#f3f2f1;border-radius:0.25rem;box-sizing:border-box;display:inline-flex;font-family:\"Noto Sans\",\"Helvetica Neue\",\"Helvetica\",\"Arial\",\"Liberation Sans\",\"Roboto\",\"Noto\",sans-serif;font-size:0.75rem;font-weight:700;line-height:1.5;position:relative;padding-left:0.5rem;padding-right:0.5rem;padding-top:2px;padding-bottom:2px;background-color:#f3f2f1;color:#595959;padding:0.5rem;transition:all 200ms cubic-bezier(0.645, 0.045, 0.355, 1);}body .js-match-insights-provider-13z8r1w svg{display:block;height:18px;width:18px;color:#767676;}body .js-match-insights-provider-13z8r1w div:empty{margin:0;}body .js-match-insights-provider-13z8r1w svg{margin-left:-0.25rem;margin-right:-0.25rem;}body .js-match-insights-provider-13z8r1w:focus{outline:none;box-shadow:0 0 0 0.125rem rgb(255,255,255),0 0 0 0.1875rem rgb(37,87,167);}body .js-match-insights-provider-13z8r1w:focus:not([data-focus-visible-added]){box-shadow:none;}body .js-match-insights-provider-13z8r1w:hover{background-color:#e4e2e0;}body .js-match-insights-provider-13z8r1w:active{background-color:#d4d2d0;}body .js-match-insights-provider-g6kqeb{display:flex;align-items:center;margin-top:-0.5rem;margin-left:-0.5rem;flex-wrap:wrap;justify-content:flex-start;}body .js-match-insights-provider-g6kqeb>.ecydgvn1{margin-top:0.5rem;margin-left:0.5rem;max-width:100%;}body .js-match-insights-provider-tvvxwd{flex:0 0 auto;min-width:0;}Część etatubody .js-match-insights-provider-f0fy6x{width:1.125rem;height:1.125rem;color:inherit;} Ready for a Challenge  Then Just Eat Takeaway.com might be the place for you. We’re a leading global online food delivery platform, and our vision is to empower everyday convenience. Whether it’s a Friday-night feast, a post-gym poke bowl, or grabbing some groceries, our tech platform connects tens of millions of customers with hundreds of thousands of restaurant, grocery and convenience partners across the globe. All about the role  Junior Live Operations Specialist - Part Time positions available  A courier with a flat tire? A damaged order? Large event in the city with roadblocks? Crazy weather conditions? Nothing is too challenging for our Live Operations teams. Our Live Operations agents support our couriers remotely, making sure they get to pick up and deliver their orders as quickly and efficiently as possible, making customers happy.  Communicating closely with our couriers, you’re able to quickly and easily solve issues like this, keeping track of their schedules and supporting them when they have a request. In addition to a well-organised and practical approach to problems, you’ll be using your communication and decision making skills to help our couriers. And you’ll also be responsible for: Work closely and collaboratively with a range of internal stakeholders; Work closely and collaboratively with a range of internal stakeholders; Tracking the deliveries on our platform to help optimise delivery times; Tracking the deliveries on our platform to help optimise delivery times; Following the automatic order distribution system; Following the automatic order distribution system; Communicate via chat or phone with couriers and/or in exceptional situations the customer. Communicate via chat or phone with couriers and/or in exceptional situations the customer.  Can you deliver…  Here are the skills and experience we’re looking for: Excellent communication skills in both English and German; Excellent communication skills in both English and German; Prior Customer Service or Operations experience is a plus; Prior Customer Service or Operations experience is a plus; Strong communication skills and ability to deal with a range of couriers and stakeholders; Strong communication skills and ability to deal with a range of couriers and stakeholders; Motivated and eager to improve your knowledge; Motivated and eager to improve your knowledge; Able to react quickly with a strong focus and willingness to solve various cases for our couriers deal with difficult situations; Able to react quickly with a strong focus and willingness to solve various cases for our couriers deal with difficult situations; Able to multitask and prioritise; Able to multitask and prioritise; Comfortable working under pressure; Comfortable working under pressure; Flexible and able to work on shifts. Flexible and able to work on shifts.   When you join us at Just Eat Takeaway.com, these great rewards are waiting for you: Variety in your work and a fantastic, informal work atmosphere; Variety in your work and a fantastic, informal work atmosphere; A challenging environment that will stimulate you to grow as a professional; A challenging environment that will stimulate you to grow as a professional; Being part of an ambitious, growing team; Being part of an ambitious, growing team; Competitive salary; Competitive salary; Hybrid working model; Hybrid working model; Location of the role : Powstańców Śląskich 9 - Midpoint office - WROCŁAW Location of the role : Powstańców Śląskich 9 - Midpoint office - WROCŁAW Strong focus on personal development (workshops / training); Strong focus on personal development (workshops / training); Budget for ordering lunches (Takeaway Pay), private health care and a sports card. Budget for ordering lunches (Takeaway Pay), private health care and a sports card. At JET, this is on the menu:  Our teams forge connections internally and work with some of the best-known brands on the planet, giving us truly international impact in a dynamic environment.  Fun, fast-paced and supportive, the JET culture is about movement, growth and about celebrating every aspect of our JETers. Thanks to them we stay one step ahead of the competition.  Inclusion, Diversity & Belonging  No matter who you are, what you look like, who you love, or where you are from, you can find your place at Just Eat Takeaway.com. We’re committed to creating an inclusive culture, encouraging diversity of people and thinking, in which all employees feel they truly belong and can bring their most colorful selves to work every day.  What else is cooking?  Want to know more about our JETers, culture or company? Have a look at our career site where you can find people's stories, blogs, podcasts and more JET morsels.  Are you ready to take your seat? Apply now! Porady zawodowe Przeglądaj oferty pracy Wynagrodzenia Kraje O nas Centrum pomocy © 2024 Indeed Dostępność w serwisie Indeed Centrum ochrony prywatności i wybór reklam Przesyłanie zgłoszeń na mocy aktu o usługach cyfrowych Strona poświęcona bezpieczeństwu w Internecie Warunki",
      "buttontext": "aplikacja w witrynie firmy",
      "easyApply": false,
      "companyName": "Junior Live Operations Specialist"
    },
    {
      "id": 8,
      "href": "https://pl.indeed.com/rc/clk?jk=5b1da8fc6efeb4cf&bb=nBiv9VFjOgI6JFVotktcpV3v_e6Zr39GryTnGdKwwjLwln_wDSMfv0fXALaGPSGXKEWhHs_FQ6N9eHiUBUwt2Z1_b825pa-JkB-J9l11ZbL2t0oeHrk7nOsdWlSGH7fe&xkcb=SoAG67M370wyw5TToZ0DbzkdCdPP&fccid=d01e848434a3d9ca&vjs=3",
      "title": "Junior JavaScript Engineer",
      "applyUrl": "https://pl.indeed.com/viewjob?jk=5b1da8fc6efeb4cf&from=serp&vjs=3",
      "description": "Prywatna opieka medyczna Check out the job offer for Junior JavaScript Engineer Min. 1 year (not necessarily commercial) experience in JavaScript programming Developed project using React and Node.js Basic best practices and design patterns English B2 For the first 6 months, work from our office in Gliwice Don't forget to send a link to your repository on GitHub or share your own projects ‍ Why is it worth working with us? Working with us, you can count on confidence in your decisions, a lot of freedom in your work and a close-knit team that exchanges knowledge. We care about partnerships, continuous development and high quality products. If you value this, then Brainhub will be the right partner to work with. ‍ Candidate profile The ideal person already has initial experience as a Junior JavaScript Fullstack Engineer and is open to learning new knowledge in the field. She is not afraid to ask questions, share ideas, participate in team discussions and make mistakes. She is open to client contact, teamwork and mentoring from experienced experts. Programming is her passion - she knows that in addition to participating in a formal mentoring program, it's important to develop skills on your own and be curious about new technologies. In Brainhub: You will develop your technical skills under the guidance of experts who will introduce you to the world of Software Delivery (the first month of employment is a mentoring program) You will gain the non-technical skils that are required to deliver business value You will learn to work in a team and work with customers You will be introduced to the project team, working on the first tasks ‍ Let's talk if: You are passionate about programming You have developed a project using React and Node.js You understand basic best practices and design patterns, you know basic data structures You understand what good practices are and why it's important to create \"clean code\" You are a person open to new challenges (TypeScript, frameworks like Fastify/NestJS/Angular, etc.). You have basic experience working with Git in a team environment You communicate fluently in English - at least at the B2 level ‍ Nice to have: You have knowledge in the area of testing You have basic knowledge of databases You have a basic knowledge of containerization (Docker) How we work at Brainhub We match people to the projects they are most passionate about, We focus on long-term projects to build quality products that help customers succeed, We carefully select our clients to make sure they fit into our culture and work ethic, We help each other and share our knowledge, we organize regular author meetups for developers (DevDuck), We are constantly working to improve our BizDevOps processes and ensure our Tech Excellence, We focus on the T-Shaped competency model - individuals gifted in multiple fields who are experts in at least one of them ‍ What do we do? We create complex NodeJS backends, We deploy microservices on a Kubernetes cluster, We develop Serverless solutions in the AWS Cloud, We support inter-process communication in Electron applications, We share code between web, mobile and backend platforms.  Workshops and training budget English lessons Company bookcase Remote and hybrid work Team meetings Integration events Dedicated role of Satisfaction Manager Free consultations with a psychologist Private medical care Porady zawodowe Przeglądaj oferty pracy Wynagrodzenia Kraje O nas Centrum pomocy © 2024 Indeed Dostępność w serwisie Indeed Centrum ochrony prywatności i wybór reklam Przesyłanie zgłoszeń na mocy aktu o usługach cyfrowych Strona poświęcona bezpieczeństwu w Internecie Warunki",
      "buttontext": "aplikacja w witrynie firmy",
      "easyApply": false,
      "companyName": "Junior JavaScript Engineer"
    },
    {
      "id": 11,
      "href": "https://pl.indeed.com/rc/clk?jk=0750a6c820fe0878&bb=nBiv9VFjOgI6JFVotktcpe26T1fu7tKM7N_2K16t_sMVWX6iu80milhCsZia6XO6jX7AFPzrZpw9GEtY8RJxlT-fAzMUcZALb5o8SMP6Z8Mha2W2J_lFffQ9JWP2dqqx&xkcb=SoCb67M370wyw5TToZ0AbzkdCdPP&fccid=661b6b92ea8096f2&vjs=3",
      "title": "Intern - Allocation",
      "applyUrl": "https://pl.indeed.com/viewjob?jk=0750a6c820fe0878&from=serp&vjs=3",
      "description": "body .js-match-insights-provider-13z8r1w{align-content:center;align-items:center;border:1px solid;border-color:#f3f2f1;border-radius:0.25rem;box-sizing:border-box;display:inline-flex;font-family:\"Noto Sans\",\"Helvetica Neue\",\"Helvetica\",\"Arial\",\"Liberation Sans\",\"Roboto\",\"Noto\",sans-serif;font-size:0.75rem;font-weight:700;line-height:1.5;position:relative;padding-left:0.5rem;padding-right:0.5rem;padding-top:2px;padding-bottom:2px;background-color:#f3f2f1;color:#595959;padding:0.5rem;transition:all 200ms cubic-bezier(0.645, 0.045, 0.355, 1);}body .js-match-insights-provider-13z8r1w svg{display:block;height:18px;width:18px;color:#767676;}body .js-match-insights-provider-13z8r1w div:empty{margin:0;}body .js-match-insights-provider-13z8r1w svg{margin-left:-0.25rem;margin-right:-0.25rem;}body .js-match-insights-provider-13z8r1w:focus{outline:none;box-shadow:0 0 0 0.125rem rgb(255,255,255),0 0 0 0.1875rem rgb(37,87,167);}body .js-match-insights-provider-13z8r1w:focus:not([data-focus-visible-added]){box-shadow:none;}body .js-match-insights-provider-13z8r1w:hover{background-color:#e4e2e0;}body .js-match-insights-provider-13z8r1w:active{background-color:#d4d2d0;}body .js-match-insights-provider-g6kqeb{display:flex;align-items:center;margin-top:-0.5rem;margin-left:-0.5rem;flex-wrap:wrap;justify-content:flex-start;}body .js-match-insights-provider-g6kqeb>.ecydgvn1{margin-top:0.5rem;margin-left:0.5rem;max-width:100%;}body .js-match-insights-provider-tvvxwd{flex:0 0 auto;min-width:0;}Stażbody .js-match-insights-provider-f0fy6x{width:1.125rem;height:1.125rem;color:inherit;} Pakiety i karty sportowe Prywatna opieka medyczna  We are STX Next, a global IT consulting company specializing in customer-focused software services. Join a group of 500 professionals dedicated to helping customers build outstanding products. Leveraging the latest advancements in the field, and a passion for innovation, we're shaping the future of technology one project at a time. Type of contract Location What you’ll do Work with company employees to create good quality anonymized CVs (collect information, write in meaningful and attractive manner, select most important information). Overview anonymized CVs process creation, manage priorities, and tasks in a small team. Convert raw project activities description into readable, high quality CV statements, with perfect English. Preparation of marketing materials (web page graphics, ebook covers, interviews post-edition, etc.). Provide support to other company departments by providing data, reports or other required input. Support Project Management Office and Allocation Manager in by fulfilling operational tasks (data collection and analysis from various internal systems, drafting documents or presentations). Support team in defining areas for process improvements. Must have: Full proficiency in English is a must (C1). Excellent communication skills (both written and verbal). Creative problem solver with strong attention to detail. Ability to work well in an international and multicultural environment. Demonstrated ability to pick up new skills proactively. Nice to have Comfortable proficiency with Google tools is a benefit (Google Sheets, Google Docs, Google Slides etc.). Understanding of software development terms & agile methodologies. Awareness of development frameworks and technologies.  Work-life Balance  Reimbursed private medical care (Medicover) and Multisport  Leader’s support  Technology focus  Growth review  Events  Workation  Porady zawodowe Przeglądaj oferty pracy Wynagrodzenia Kraje O nas Centrum pomocy © 2024 Indeed Dostępność w serwisie Indeed Centrum ochrony prywatności i wybór reklam Przesyłanie zgłoszeń na mocy aktu o usługach cyfrowych Strona poświęcona bezpieczeństwu w Internecie Warunki",
      "buttontext": "aplikacja w witrynie firmy",
      "easyApply": false,
      "companyName": "Intern - Allocation"
    },
    {
      "id": 12,
      "href": "https://pl.indeed.com/rc/clk?jk=d8960538249b5ee6&bb=nBiv9VFjOgI6JFVotktcpVQf8BKrxmj5YHVNYsCBOAmLX3zUq4q9mGTuz_6B339WNBnX7aX7MXqwwkplA0C9AgkbElSkC7d0dU-fKd8B66pWi-q0xjnlYgCuYArq0c72&xkcb=SoAV67M370wyw5TToZ0HbzkdCdPP&fccid=8a9b2c1a4a307d7a&vjs=3",
      "title": "Senior UI Developer",
      "applyUrl": "https://pl.indeed.com/viewjob?jk=d8960538249b5ee6&from=serp&vjs=3",
      "description": "Pakiety i karty sportowe Program poleceń pracowniczych Prywatna opieka medyczna As a recruitment company, DCG understands that every business is powered by experienced professionals. Our management style and partnership approach enable us to meet your needs and provide continuous support. Due to our ongoing growth and the large number of recruitment projects we undertake for our partners, we are currently looking for: Responsibilities: Develop high-quality, user-centric UIs for diverse business and technical stakeholders Actively participate in Agile development processes, contributing to sprints and iterative development Ensure software simplicity, maintainability, and reusability through high coding standards Engage in code and design reviews to maintain quality and consistency across the team Innovate and proactively work on unique solutions to complex problems Collaborate with business and technical teams to define and implement effective solutions Maintain strong communication with development, support, and infrastructure teams Write thorough automated tests, including unit and integration tests Contribute to the creation and enforcement of architectural standards and development best practices Mentor and support junior developers, sharing knowledge and guiding them through technical challenges Influence the strategic direction of the UI team and the broader development group  Requirements: Minimum of 6 years of commercial experience, with at least 3 years specializing in React Strong proficiency in modern JavaScript, HTML, and CSS Expertise in Node.js and npm, including experience publishing npm libraries At least 2 years of experience with TypeScript Solid understanding of RESTful web services and API design Strong communication skills and technical writing ability for documentation Good understanding of data structures and computer science fundamentals A precise and high-quality approach to development, combined with pragmatism and collaboration Very good command of English (oral and written) Experience in Investment Banking or Finance Experience building developer tooling and working with messaging systems and event-driven architectures Familiarity with GraphQL and micro-frontends  Offer: Private medical care Co-financing for the sport card Training & learning opportunities Constant support of dedicated consultant Team-building events organized by DCG Employee referral program Porady zawodowe Przeglądaj oferty pracy Wynagrodzenia Kraje O nas Centrum pomocy © 2024 Indeed Dostępność w serwisie Indeed Centrum ochrony prywatności i wybór reklam Przesyłanie zgłoszeń na mocy aktu o usługach cyfrowych Strona poświęcona bezpieczeństwu w Internecie Warunki",
      "buttontext": "aplikacja w witrynie firmy",
      "easyApply": false,
      "companyName": "Senior UI Developer"
    },
    {
      "id": 13,
      "href": "https://pl.indeed.com/rc/clk?jk=bbacd975ac9347fe&bb=nBiv9VFjOgI6JFVotktcpasHU8-ggtynj1-yfmuiKkGaYDG35eZk0FLNDpXldbwarHgjL6wCc1liQ6yOoW9Q2a1N69Mpe5SVFPVv-NQa8czEFHpEQrCg1Gw0cE-Ktlv5&xkcb=SoCh67M370wyw5TToZ0GbzkdCdPP&fccid=661b6b92ea8096f2&vjs=3",
      "title": "Machine Learning Engineer",
      "applyUrl": "https://pl.indeed.com/viewjob?jk=bbacd975ac9347fe&from=serp&vjs=3",
      "description": "Pakiety i karty sportowe Prywatna opieka medyczna  We are STX Next, a global IT consulting company specializing in customer-focused software services. Join a group of 500 professionals dedicated to helping customers build outstanding products. Leveraging the latest advancements in the field, and a passion for innovation, we're shaping the future of technology one project at a time. Type of contract Location The role of a Machine Learning Engineer has many variations, we are not looking for someone who is good at everything, but people with in-depth knowledge of a particular domain of NLP, Computer Vision or Recommender systems. What is important to us is the foundation and basic understanding of the problems and ideas behind ML.We use ML methods in practice so we also value the ability to implement models in the form of API or integration with the client's system.  Core values We believe that every problem has a solution, often hidden and not so obvious. Our job is to work them out and the best are born from imagination, cooperation and craftsmanship. How do we work? We work with clients for their benefit and the benefit of their target users. We often act as consultants and architects, people who tear down the existing order, introducing changes and innovations. But just as often we act as craftsmen who must deliver software of the highest quality. What will daily work look like? We expect knowledge of: Strong fundamentals of machine learning: types of ml problems: classification, regression, clustering, etc common evaluation measures: precision, recall, F1, IoU, ROUGE etc scikit-learn models (random forest, SVM, xgboost), ensemble models etc. understanding dimension reduction techniques (PCA, TSNE, Umap) Data preparation and visualization libraries (pandas, matplotlib etc.). Knowledge of current neural networks architectures (RNN, CNN, Transformers) and methods (transfer learning). Documented experience with one of the libraries: PyTorch or Tensorflow. Good knowledge of relational databases and experience with one of : PostgreSQL, MySQL, MS SQL, Oracle. Familiarity with Python.  Soft skills: Good communication skills in English (minimum B2). Problem solving and analytical thinking. Be nice and friendly.  Work-life Balance  Reimbursed private medical care (Medicover) and Multisport  Leader’s support  Technology focus  Growth review  Events  Workation  Porady zawodowe Przeglądaj oferty pracy Wynagrodzenia Kraje O nas Centrum pomocy © 2024 Indeed Dostępność w serwisie Indeed Centrum ochrony prywatności i wybór reklam Przesyłanie zgłoszeń na mocy aktu o usługach cyfrowych Strona poświęcona bezpieczeństwu w Internecie Warunki",
      "buttontext": "aplikacja w witrynie firmy",
      "easyApply": false,
      "companyName": "Machine Learning Engineer"
    }
  ]
]